const base = {
  Aries: [
    {
      yesterday:
        "Покажите другому, что готовы прийти на помощь, не дожидаясь, пока Вас попросят. Сегодня отличный день, чтобы получить очки в карму.",
    },
    {
      today:
        "Вам следует временно отложить личный вопрос, даже если он кажется срочным. Ситуация у близкого человека неважная; Ваша помощь нужна там.",
    },
    {
      tomorrow:
        "Вам сегодня нужно слушать людей, иначе отношения с ними могут испортиться. Им нужно знать, что Вам не все равно, даже если больше ничем Вы помочь не можете.",
    },
  ],
  Taurus: [
    {
      yesterday:
        "Эмоциональная сторона Вашего 'Я' сегодня трудится сверхурочно, но это весьма приятно и совсем не утомительно. Вы сможете наконец понять друга или любимого человека.",
    },
    {
      today:
        "Работа кажется Вам интересной и увлекательной; так держать! Если находитесь в процессе смены профессии, то сегодня поступит интересное предложение - пусть и не входящее в Вашу зону комфорта.",
    },
    {
      tomorrow:
        "Сейчас важно уделить время своему физическому и психическому здоровью - если, конечно, Вы хотите прожить жизнь с толком. Сделайте первый шаг навстречу ЗОЖ!",
    },
  ],
  Gemini: [
    {
      yesterday:
        "Сегодня постарайтесь не потеряться в пустой болтовне. И так все очень странно, не хватало еще потерять нить разговора! Вы готовы слушать, но дать совет - едва ли.",
    },
    {
      today:
        "В личной жизни все радужно-прекрасно. Независимо от статуса отношений Вы обнаружите больше романтики и удовлетворенности в своей жизни.",
    },
    {
      tomorrow:
        "Вас по-прежнему переполняет положительная энергия, так что Вы сможете поднять настроение кому угодно - в том числе и себе! Самое время укрепить свою репутацию балагура.",
    },
  ],
  Cancer: [
    {
      yesterday:
        "Сейчас Вы как раз в настроении для уборки дома или на работе, но едва ли - для больших начинаний. Донесите до окружающих важность аккуратности.",
    },
    {
      today:
        "Сосредоточьтесь на партнерстве - возможно, романтическом, а может быть, рабочем или дружеском. Это может быть непросто, но результат будет стоить всех усилий.",
    },
    {
      tomorrow:
        "У Вас сегодня наметится конфликт с другим человеком, но бояться тут нечего. Расскажите о своих переживаниях, а потом внимательно выслушайте претензии другой стороны.",
    },
  ],
  Leo: [
    {
      yesterday:
        "Финансовые дела немножко сводят Вас с ума, но это не плохо! Вы сможете придумать хитрый ход, который спасет положение. Ситуация мигом улучшится.",
    },
    {
      today:
        "Сильно ли технологии влияют на Вашу жизнь? Даже если Вы в этом плане старомодны, все равно сегодня отличный день, чтобы попробовать новый гаджет. Он окажется полезным инструментом.",
    },
    {
      tomorrow:
        "Вам сегодня нужно проявить инициативу и начать действовать. Пассивность чревата проблемами. Сегодня день, когда нужно так или иначе дать себе встряску.",
    },
  ],
  Virgo: [
    {
      yesterday:
        "Сегодня старайтесь активнее помогать людям, что может быть нелегко, ведь Вы играете важную роль во многих судьбах. Также сейчас самое время отпустить все то, за что Вы держитесь совершенно зря.",
    },
    {
      today:
        "Вы сегодня страшно нерешительны, но важно иметь дело с реальностью, а не со своими фантазиями на ее счет. Если можете пару дней подождать с выбором - тем лучше!",
    },
    {
      tomorrow:
        "Сегодня хороший день для крупных покупок, но принимать решения нужно сообща с кем-то. Спросите совета у друга или бизнес-партнера - либо попробуйте организовать складчину.",
    },
  ],
  Libra: [
    {
      yesterday:
        "Постарайтесь не сойти с ума от всех своих забот и хлопот. Вас буквально завалит! Но если немного отрешиться от ситуации, Вы увидите, что все это - часть плана.",
    },
    {
      today:
        "Ваш уровень энергии сегодня на удивление высок, так что наслаждайтесь активной жизнью! Можете заняться делами, а можете просто расслабиться и повеселиться.",
    },
    {
      tomorrow:
        "Человек, чье внимание Вы уже давно пытаетесь привлечь, наконец Вас заметит. Речь может идти не только о романтике, но так или иначе - примите поздравления!",
    },
  ],
  Scorpio: [
    {
      yesterday:
        "Вам сегодня стоит уделить внимание другу, особенно если Вы давно его не видели. Пусть болтает сколько хочет! Также можно что-нибудь подарить ему или ей.",
    },
    {
      today:
        "Обратите взгляд внутрь себя и постарайтесь понять, чего Вы хотите. Ответ Вас наверняка удивит. Новый знакомый или знакомая задаст вопрос, который захватит Ваше воображение.",
    },
    {
      tomorrow:
        "Вам сегодня можно и отдохнуть - все уже готово! Просто расслабьтесь и наблюдайте за тем, как вращаются шестеренки. Впрочем, довольно скоро снова потребуется Ваше участие.",
    },
  ],
  Sagittarius: [
    {
      yesterday:
        "Сегодня такой день, когда не грех и надавить, а Вы на это способны. Но торопиться никуда не нужно. Пусть все события протекают своим чередом.",
    },
    {
      today:
        "Как только Вы в полной мере обратитесь к переполняющей Вас сегодня энергии, Вы найдете, что жизнь стала очень увлекательной. Даже самая унылая работа внезапно будет Вам в радость.",
    },
    {
      tomorrow:
        "Смех сегодня - ключ ко всему. Искренний он или натужный? В любом случае Ваш смех повлияет на настроение тех людей, которые Вас окружают.",
    },
  ],
  Capricorn: [
    {
      yesterday:
        "Самое заняться планированием будущего - следующей недели, следующих десяти лет. Ситуация заметно улучшится, если Вы все спланируете наперед.",
    },
    {
      today:
        "Перед Вами окажется вызов, к которому следует отнестись со всей серьезностью и уделить время и внимание. Вы не проиграли! Надо просто потрудиться.",
    },
    {
      tomorrow:
        "Начальство, кажется, позволяет себе лишнее, но постарайтесь не слишком переживать на эту тему. Уже завтра ситуация вернется в привычную колею. Будьте терпимее!",
    },
  ],
  Aquarius: [
    {
      yesterday:
        "Рабочие вопросы сегодня могут стать проблемой. Старайтесь сосредоточиться на собственных проектах и не мешать других. Спустя день-другой все станет проще и понятнее.",
    },
    {
      today:
        "Сегодня постарайтесь взглянуть на вещи под новым углом - у Вас как раз подходящий для этого настрой. В какой-то момент, впрочем, придется спросить совета.",
    },
    {
      tomorrow:
        "Довольно держаться за привычную рутину! Пора попробовать что-то совершенно новое. Сегодня Вам доступны великие дела с обширными последствиями.",
    },
  ],
  Pisces: [
    {
      yesterday:
        "Происходящее кажется абсурдным, но это ничего! Позже Вы во всем разберетесь. Будьте гибче, и все сложится отменно.",
    },
    {
      today:
        "Вам придется заняться денежным потоком, который может создать проблемы где-то ниже по течению. Важно, чтобы Ваши решения подходили всем заинтересованным лицам; обсудите их.",
    },
    {
      tomorrow:
        "Если в Вашей жизни существует проблема долга, постарайтесь разрешить ее всеми средствами и силами. Сейчас Вы как раз в нужном настроении для подобного.",
    },
  ],
};

class Horoscope {
  constructor(base) {
    (this.base = base),
      (this.container = document.querySelector(".infohoroscope")),
      (this.input = document.querySelector("#horoscope")),
      this.renderHoroscope();
  }

  renderHoroscope() {
    this.input.addEventListener("keydown", (e) => {
      const finishDate = this.checkData(e.target.value);
      let flag;
      if (e.key == "Enter") {
        if (finishDate >= "03-25" && finishDate <= "04-19") {
          flag = "Aries";
          this.getInfo(flag);
        } else if (finishDate >= "04-20" && finishDate <= "05-20") {
          flag = "Taurus";
          this.getInfo(flag);
        } else if (finishDate >= "05-21" && finishDate <= "06-20") {
          flag = "Gemini";
          this.getInfo(flag);
        } else if (finishDate >= "06-21" && finishDate <= "07-20") {
          flag = "Cancer";
          this.getInfo(flag);
        } else if (finishDate >= "07-23" && finishDate <= "08-22") {
          flag = "Leo";
          this.getInfo(flag);
        } else if (finishDate >= "08-23" && finishDate <= "09-22") {
          flag = "Virgo";
          this.getInfo(flag);
        } else if (finishDate >= "09-23" && finishDate <= "10-22") {
          flag = "Libra";
          this.getInfo(flag);
        } else if (finishDate >= "10-23" && finishDate <= "11-21") {
          flag = "Scorpio";
          this.getInfo(flag);
        } else if (finishDate >= "11-22" && finishDate <= "12-21") {
          flag = "Sagittarius";
          this.getInfo(flag);
        } else if (finishDate >= "12-22" && finishDate <= "01-19") {
          flag = "Capricorn";
          this.getInfo(flag);
        } else if (finishDate >= "01-20" && finishDate <= "02-18") {
          flag = "Aquarius";
          this.getInfo(flag);
        } else if (finishDate >= "02-19" && finishDate <= "03-20") {
          flag = "Pisces";
          this.getInfo(flag);
        }
      }
    });
  }

  checkData(str) {
    const addZero = (num) => {
      if (num <= 9) {
        num = "0" + num;
      }
      return num;
    };
    const convertDate = (str) => {
      str = str.split(".").reverse().join("-");
      return str;
    };
    const date = new Date(convertDate(str));
    str = addZero(date.getMonth() + 1) + "-" + addZero(date.getDate());
    return str;
  }

  getInfo(key) {
    const checkDay = () => {
      const form = document.querySelector(".form--horoscope");
      const radioChoise = form.querySelectorAll("input");
      for (const iterator of radioChoise) {
        if (iterator.checked)
          return iterator.getAttribute("data-value").toLowerCase();
      }
    };
    const option = checkDay();
    if (this.base[key]) {
      this.container.innerHTML = "";
      for (const iterator of this.base[key]) {
        if (iterator[option]) {
          this.container.insertAdjacentHTML(
            "afterbegin",
            `<p class="flow-text">${iterator[option]}</p>`
          );
        }
      }
    }
  }
}
const myHoroscope = new Horoscope(base);
